## 딥러닝에서 스스로를 증명하기 위해 학위를 대체할 수 있는 방법들

금주의 “Ask-A-Data-Scientist” 칼럼에서는  저의  모교 Swarthmore의  신입생으로부터  온  문의에  대해  얘기하고자  합니다. 데이터  사이언스에  관하여  궁금한  사항들은  [rachel@fasta.ai](mailto:rachel@fasta.ai)  로  문의주세요. 명확성과  간결성을  위하여  해당  문의는  조금의  수정이 있습니다. 이전에  다루었던  내용들은  다음과  같습니다.

-   [어떻게 공부시간에 집중할 수 있을까요? 어떻게 내 전문성을 찾을 수 있을까요? ](https://www.fast.ai/2017/03/23/focus-on-coding/)
-   [서비스로서 머신러닝은 동작하나요? 박사학위가 필요할까요?](https://www.fast.ai/2017/03/17/not-commoditized-no-phd/)
-   [어떻게 커리어를 전환하여 데이터 과학자가 될 수 있을까요?](https://www.fast.ai/2017/03/01/changing-careers/)
-   [데이터 과학자 및 엔지니어링 팀을 구성하는 법에 대하여](https://www.fast.ai/2016/12/08/org-structure/)
-   [딥러닝에 관심이 있는 학생들을 위한 조언](https://www.fast.ai/2016/12/19/favorite-posts/)


**Q**: 저는  현재 Swarthmore College의  신입생입니다. 저는  머신러닝과  딥러닝에  큰  관심을  가지고  있습니다. 이번  학기에  인공지능과목을  수강하기를  원하였으나, 높아진  관심도를  컴퓨터  공학부에서  감당할  수  없었기  때문에  어떤  신입생도  인공지능과목을  수강하지  못하였습니다.

현재  저는 Andrew Ng 선생님의  머신러닝  수업을 Cousera 에서  수강하고  있으며 2~3주  안에  수강을  완료할  것  같습니다. 그  이후, hacker news에서  보았던 fast.ai 의 [MOOC](http://course.fast.ai/) 강의를  수강하기를  계획하고  있습니다.

당신이  매우  바쁜  것은  알고  있지만, 저의  머신러닝에  관련된  질문  및  저의  계획에  대하여  여쭤봐도  될까요? fast.ai의  강의  및 Ng선생님의  강의를  모두  수강한  이후  저는  무엇을  더  배워야  할까요? 제가  생각하기에는 1) 연구를  진행하거나 2) UPenn에서  진행되는  대학원  수준의  강의를  듣는  것 ( Swarthmore에서  그  강의에  들어가는  것은  어려워  보이기는  합니다. 특히  신입생에는  더욱  더  그럴  것  같네요 ) 과  같은 2가지  선택지가  있어  보입니다. 조언  해주신다면  정말  감사하겠습니다.


**A**: 우선  시간이  조금  들기는  하지만  답변할  수  있어  매우  기쁩니다. 기술적인  질문에  대해서는  우선 [fast.ai 의 포럼](http://forums.fast.ai/)을  이용하는  것이  좋은  방법이  될  것  같네요. 정말  수  많은  흥미로운  논의들이  우리  포럼에서  이뤄지고  있거든요. 우리  강의를  수강하고  있지  않더라도  한번  살펴보세요.  
커리어에  관련된  질문에  대해서는, 주로 ask-a-data-scientist column에  대답하곤  합니다.  
  
  
1. Swarthmore 또는 UPenn의 AI 수업을  듣지  않더라도, 딥러닝에  관련된  것들  또는  공부를  할  방법들은  수없이  많습니다. Fast ai 의 MOOC 코스를  완료하기  위해서만  하더라도 70시간이나  소요되고, 만약 Kaggle 대회에  관심이  있다면  더  많은  시간이  걸릴  것입니다. 아마  몇  달  내로 Part2를  공개할  예정입니다. 아마 Part 1 과  비슷한  시간이  소요될  것입니다. Part2는  더  공부할  거리와  읽을  만한  논문  추천, 그리고  어떻게  일을  더  확장할  수  있는지에  대한  내용이  더  추가될  것입니다.  
  
2. 가능하다면 Official class를  들으세요. 하지만  반드시  수강자격증명이나  리소스가  필요한  것은  아닙니다. (대학에  다니지  않거나 AI 강의를  제공하지  않는  대학에  다니더라도  걱정하지  마세요: 꼭  그것들이  필요한  것은  아닙니다!)  경제학을  전공하고  석사학위가  없는  우리  학생  중  한  명도  저명한 [Google Brain residency](https://research.google.com/teams/brain/residency/) 프로그램에  선발되기도  하였습니다. 또  우리  강의  자료를  이용하여  사기를  탐지해  낼  수  있는  신기술을  연구하던  한  학생도  그  직업에서  보너스를  얻기도  하였습니다. 다른  학생들  역시  인턴십  기회를  얻거나 job-offer를  받기도  하였습니다. 혹은  현재  직장에서  흥미로운  머신러닝  프로젝트를  다루는  부서로  이동하기도  하였습니다.

수강증은  분명히  문을  처음  진입하는데  도움을  줍니다. 특히  당신이  기술분야에서  무언가  증명할  것이  없다면  혹독한  실력확인  절차를  밟을  것입니다.  
  
그러나  당신을  알릴  수  있는  수강증보다  **더  효과적인  방법들**은  많이  있습니다.  
  
- 유명한  블로그에  글을  게시한다
-  흥미로운  앱을  개발하여  온라인에  게시한다
- [learnmachinelearning subreddit](https://www.reddit.com/r/learnmachinelearning/)이나 [fast.ai forums](http://forums.fast.ai/)에  올라온  질문들에  대하여  답변을  단다. 남을  위하는  마음은  제게  중요하기는  하지만  제가  답변을  다는  것을  추천하는  이유는  남을  돕기  위함만은  아닙니다. 당신이  배운  것을  남에게  알려주는  것은  **당신의  지식을  확실히  하는  데  효과적인  방법이기  때문입니다.**
- 당신만의  실험을  진행하고, 그  결과를 blog 또는 github에  올려보세요. 우리  학생  중  한명인 Slav Ivanov는 style transfer 작업에  대하여  다른 optimizer를  이용하여  실험을  진행하였습니다. 그리고  그는  그에  대한  훌륭한  결과를  [블로그에  게재](https://medium.com/slavv/picking-an-optimizer-for-style-transfer-86e7b8cba84b)하였죠. 그  결과는  레딧에서  화제가  되어  더  유명해지기도  하였습니다.  
- 오픈소스에  기여하세요. 여기 Tensorflow에  기여한학생의  [긍정적인  경험에  대한  글]((http://forums.fast.ai/t/contributing-back-to-the-tools-we-use/1940))이  있습니다. 그는 단 3줄의  코드로 Android 상의 tensorflow의 binary의  크기를 10MB 이하로  줄였습니다.  
  
일반적으로  저는  흥미가  있는  분야에  딥러닝을  응용한  사이드  프로젝트를  진행하는  것을  추천합니다. 그럼으로써  일할  거리를  가질  것입니다.  

## 왜  당신은 ( 맞아요, 이  글을  보는  당신! ) 은  블로그를  써야할까요?

제가  드리고  싶은  가장  중요한  조언은  블로그를  쓰는  것을  최대한  빠르게  시작하라는  것입니다. 여기  몇  가지  이유를  설명드리면- 블로그는  일종의  자기소개서  같은  것입니다. 저는  좋은  블로그  글을  작성함으로써  직업제안을  받은  사람들을  알고  있습니다!  
- 배우는  것을  도와줍니다. 잘  정리된  글을  쓰는  것은  사고를  배운  것을  통합하는  데  많은  도움을  줍니다. 누군가에게  잘  설명을  한다는  것은  내가  그  아이디어를  잘  이해하였는지를  체크하는  데에도  많은  도움이  됩니다. 블로그는  그  좋은  수단이죠!  
- 저는  블로그로부터  컨퍼런스에  초대되거나  연사로  초대되기도  하였습니다. 저는 Tensorflow Dev Summit 에 [I don’t like Tensorflow](http://www.fast.ai/2017/01/03/keras/) 라는  글로  초청된  경험도  있습니다. ( 정말  훌륭한  경험이었어요!)  
- 새로운  사람을  만납니다. 제  글에  답글을  남겨준  사람들과  만나서  소통할  수  있었어요.  
- 시간을  아껴줍니다. 반복되는  질문들에  대한  답을  블로그에  옮겨  놓는다면, 다음  비슷한  질문들에  대하여  블로그를  참조하여  더  쉽게  대답을  할  수  있습니다.

조금  더  영감을  주기  위해  우리  수업의 part2를  수강중인  학생들의  샘플  포스트를  보여드리겠습니다.  
  

-   [Linear Algebra Cheat Sheet for Deep Learning](https://medium.com/towards-data-science/linear-algebra-cheat-sheet-for-deep-learning-cd67aba4526c)
-   [CNNs from Different Viewpoints](https://medium.com/@matthewkleinsmith/cnns-from-different-viewpoints-fab7f52d159c)
-   [Setting up a Deep Learning Machine in a Lazy yet Quick Way](https://medium.com/@sravsatuluri/setting-up-a-deep-learning-machine-in-a-lazy-yet-quick-way-be2642318850)
-   [Non-artistic Style Transfer (or How to Draw Kanye using Captain Picard’s Face)](https://hackernoon.com/non-artistic-style-transfer-or-how-to-draw-kanye-using-captain-picards-face-c4a50256b814)

저는  이런  블로그  글들을  정말  좋아합니다. 저는  이런  활동이  그들을  위축시킨다고  생각하지  않습니다. 그들은  조금  더  그들에게  접근도를  높이기  위해  이런  글을  작성하였습니다.  


## 블로그를 시작하기 위한 팁들
  
제레미는  저에게  몇  년  동안이나  블로그를  시작하여야  한다  제안하였습니다. 그리고  저는  으레 “나는  할말이  없어” 라  반응하곤  했습니다. 그것은  사실이  아니었습니다. 내가  의도한  것은  내가  쓴  글에  대한  확신이  없다는  것이었습니다. 그리고  내가  쓰고자  하는  글들은  이미  더  전문성있고, 글을  쓰는  솜씨가  좋은  사람들이  이미  쓰여졌다고  느꼈습니다.

하지만  모든  것은  괜찮아요. 당신이  쓴  것은  지구를  산산조각낼  만큼  혁신적이거나  새로운  필요가  없어요. 제  글  솜씨는  처음에는  서툴렀지만 ( 제가  수학과  컴퓨터  공학을  전공한  이유는  글  쓰는  일이  많이  없기  때문이기도  하였는데 ) 점점  더  나아지고  있습니다.  
  
여기  첫  글을  쓰기  위한  팁을  조금  더  드리겠습니다.  
  
- 당신이  좋아하는  다른  블로그  글이나  기사  또는  연구에  대한  링크의  목록을  만드세요. 그리고  그  글감들에  대한  요약이나  당신이  생각하기에  중요한  부분들을  쓰세요. 초기  제  블로그의  포스트들을  그런  리스트로부터  작성되었습니다. 왜냐하면  제가  훌륭하다고  생각하는  것들을  다른  사람들이  읽지  않았을  것이라  상상하지  못했거든요.  
  
- 수업이나  컨퍼런스에  참여하고  난  후  배우게  된  것들에  대하여  요약하여  글을  쓰세요- 두  번  이상  같은  내용으로  답변을  했던 email은  블로그에  포스트해두세요.  

- 완벽주의자가  되려  하시  마세요. 저는  장장 9개월에  걸쳐  저의  [첫  블로그  글](https://medium.com/tech-diversity-files/if-you-think-women-in-tech-is-just-a-pipeline-problem-you-haven-t-been-paying-attention-cb7a2073b996)을  작성했습니다. 그  증상은  더  심각해졌고, 결국  그  이후로  구독자수도  반복해서  최저점을  찍었죠. 2017년의  저의  목표는  더  빠르게  그리고  너무  집착하지  않고  포스팅을  하는  것입니다. 왜냐면  그것은  저를  압박할  뿐이고, 포스트를  하는데  방해가  될  뿐이기  때문이죠.  

- 당신은  당신의  한  단계  이전의  상태에  있는  사람들을  돕기에  가장  좋은  위치에  있습니다. 글감들은  당신에게도  역시  새로울  것입니다. 많은  전문가들은  그것들이  초심자에게(혹은  중급자에게) 어떻게  받아들여지는  지  잊어버렸습니다. 또  왜  이  주제가  처음  보았을  때  이해하기  어려운지를  잊었습니다. 당신만의  배경과  문체  그리고  지식은  당신이  쓰고  있는  주제에  대하여  조금은  다른  관점을  제공할  것입니다.  
-  [What would have helped you a year ago? What would have helped you a week ago?](https://jvns.ca/blog/2016/05/22/how-do-you-write-blog-posts/)
- 만약  당신이  뉴욕이나  시카고, 샌  프란시스코의  여성이라면, 나는  당신이  [쓰고/말하고/코딩하는  클럽](http://www.writespeakcode.com/chapters/)에  들어가기를  권합니다. 이  모임은  여성  개발자에게  블로그  글을  쓰고, 컨퍼런스에서  발표하며, 오픈소스에  기여하기를  권장합니다.  
- 화난  상태가  되세요. 제가  결정적으로  글을  쓰게  된  계기는  한  유명한  분께서  저를  화나게  하는  말을  했기  때문입니다. 저는  너무나  화가  나서, 그의  생각이  틀렸다는  것을  설명하기위해  열심히  글을  쓸  수밖에  없었습니다.  
- 실제로  어떻게  글을  쓸  수  있을지에  대하여  고민하고  있다면, [Medium](https://medium.com/new-story)은  시작하기  좋은  옵션입니다. 또  다른  옵션은 [Jekyll과 Github Page](https://help.github.com/articles/using-jekyll-as-a-static-site-generator-with-github-pages/)를  이용하는  것입니다. 개인적으로  저는  한  글을  두  소스  모두에  올리고, 둘  다  시용하는  것을  추천합니다.

 당신은 MOOCs 의  강의를  수강함으로써, 또  사이드  프로젝트를  진행함으로써, 온라인  커뮤니티에  참가함으로써  그리고  블로그에  글을  남김으로써  바른  길을  가고  있습니다. 그것들을  통하여  더  많은  배움의  기회와  만남의  기회가  있을  것입니다!
